#coding=utf-8
import sys
reload(sys)
sys.setdefaultencoding("utf-8")
import scrapy
import re
import urlparse
import cookielib
import urllib2
import urllib
from scrapy.selector import Selector  
from datetime import datetime
from scrach.items import DmozItem
from bs4 import BeautifulSoup


class DmozSpider(scrapy.Spider):  
    name = "house"  
    allowed_domains = ["url"]
    keywordList = ['巴黎都市','巴黎花园洋房','白云桥家园经济适用房','百福公寓','百汇大厦','百家公寓','百乐家园','百绿公寓','宝嘉丽苑','宝石公馆','北禾大厦','碧水澜湾','滨江花园','铂金府邸','才智汇广场','昌盛花园','世嘉花园二期','诚恒世嘉二期','诚恒世嘉花园','承安萃苑','城南花园','春波景苑','春风里','春晓源·燕园','纯高国际现代商务花园','翠堤紫府','翠湖花园','当代华府','德秀苑','东港文化中心','东豪名都','东菱梅湾花园','东升苑','都市文涛苑','多德福食品市场','纺源置业2幢、8幢、9幢','放鹤洲花园','翡翠花园','凤凰花苑','凤鸣公寓','凤鸣佳苑','凤桥农产品交易市场','福临新家园','府林绿都','府南花园','富安龙园、富安广场','富安臻园','格兰英郡','格林小镇','公元壹号花园','观澜大厦','广宜文苑','国贸中心','海德饰博汇','海纳公馆东园','海纳公馆西园','海上新园','汉塘文化广场','翰林府第','豪杰·翡翠湾','豪仕登大厦','好得利商厦','好第坊','好第坊四期(13号楼、地','禾城世纪花园','禾东公寓','和风丽园','和润商厦','河畔名邸','恒隆商厦','红树湾','虹桥商厦','虹桥生活港','洪惠佳苑','花园小区','华府广场','华隆广场','华天国贸广场','环贸中心','皇马公寓','徽商大厦','汇金广场','汇源花苑','汇众广场','汇众佳苑','佳源都市','佳源都市五期','佳源中心广场','嘉城景帆苑','嘉城绿都小区','嘉德别墅','嘉辉大厦','嘉佳家院','嘉盛龙庭','嘉兴·中国南方纺织城','嘉兴川富置业有限公司运河','嘉兴创都国际名城','嘉兴创都国际名城专业市场','嘉兴恒大绿洲','嘉兴鹿都购物广场','嘉兴市京润大厦','嘉兴市秀洲区油车港镇马厍','嘉兴万达广场春江中心','嘉兴万达广场秋江花苑','嘉兴总部商务花园7号楼','嘉悦大厦','嘉洲世贸中心','建国北路商业街及月河历史','建国路、秀水兜、坛里商铺','江南·润园','江南·现代印象','江南·幸福里','江南巴比伦','江南摩尔','江南润园','江南太阳城','姜家村公寓','金鼎广场','金都.九月洋房','金桥巴黎商街一期','金桥假日丽厦','金桥名苑','金色恬园 禾兴大','金色恬园二期','金域兰庭','金源公寓','锦绣江南(三期)','锦绣江南小区','锦绣江南小区(二期)','泾港花苑','泾水公寓','景尚雅苑','举秀苑','聚成大厦','骏园','咖尔花园','开盛小商品批发市场(西区','凯旋广场','康桥花园','兰庭','立达汇园','丽池庄园','丽岛嘉苑','丽景苑','利丰商业中心','莲花广场','良友国际商办楼1、2#楼','凌波苑','龙盛·右岸美墅','龙盛·右岸名邸','龙盛华城右岸','龙翔大厦','龙泽园东区','隆禧大厦','鹿都景苑/鹿都购物广场','罗马都市二期','罗马都市一期','绿城悦庄','绿景华庭','绿景名邸','绿景沁园','玫瑰恬园','美达商贸中心','美迪家园','梦蝶花苑','米兰风景','名骏豪庭','名品商贸中心','名仕花苑','明洲园','茗品别墅三期','茗品别墅一期','木林森 嘉兴国际商贸城','南德大院','南都苑','南方大厦','南湖菱香坊','南湖区商会大厦','南溪花园','农翔苑','欧格大厦','蓬莱雅苑','乾庄','浅水湾','亲亲家园/新锐商务楼','青春大厦','清华府邸','晴湾佳苑','庆丰苑','秋泾公寓','日月湾','融通商务中心','润嘉园','润泽名邸','三景花园','三泰家园','杉禾生活广场','上郡','上源华庭','尚城家园','尚东名邸','尚景翠苑','尚景蓝湾','尚园','盛大花园','盛世豪庭','世合小镇','书香名苑','水岸丽都','四季大厦','台升悦园','太平洋商贸中心','泰富中心','探花苑','桃源东湾二期','桃源东湾一期','桃源林语坊','桃源林语坊','桃源林语坊','桃源小洲','桃源小洲三期','桃源小洲五期','桃源小洲一期','天城园林居','天德嘉兴汽配城','天风阁','天华苑','天乐苑','天星如意湾','同方燕语林苑','万达广场','万福大厦','万豪大厦','万和大厦','万家花园','万家汇商业广场','万丽广场','万隆广场','王店家电创业中心标准厂房','王店家电创业中心广场二期','王店镇金桥商街','望湖名苑一期','文博苑','文博苑二期','文锦苑','文贤苑','文星花园 海棠苑','文星花园海棠苑','文星花园汇龙苑','文星花园长中苑','吴越花苑','夏宫花园','香岛花苑','香格里','香缇世家','香橼别墅','湘湖长岛','新塍花园','新塍中心广场','新东方花园','新都名邸','新禾家苑','新领域广场','新文化广场','新雅公寓','新亚·香榭水岸','新语花苑','新中花园','新洲国际大酒店','信达东郡','信源亲水湾','信远朗庭','兴港公寓','兴港商贸中心','秀湖花苑','秀嘉农贸市场及综合楼','秀沁苑','秀水人家','秀水瑞苑','秀泽园','秀洲毛衫制造业科技园','旭辉广场','学仕苑','雅苑','阳光乐园','依云小区','艺秀园','逸林雅苑','逸庭广场','银河湾','英澜名郡','英伦都市','映月花园','永汇府邸','优湖名苑','优佳花苑','优优花苑','宇隆嘉苑','郁金香花园','育龙湾','御翠花苑','御华名都','御锦湾','御上江南景园','御上江南瑞园','御缇嘉苑','御香苑','悦声名苑','越秀北路766号商办楼','云间绿大地','浙联金座','正阳公寓','至美里','智富中心','智谷公寓','置地大厦','中安商贸园','中成新世纪公寓','中港城娱乐城','中港名都二期','中港名都三期','中港名都四期','中港名都一期','中国嘉兴(国际)毛衫城','中禾广场','中南公寓','中南家居广场','中楠·穆溪左岸','中瑞商厦','中润瑞安广场','中山大厦','中山名都绿洲','中纬大厦','紫金豪庄','紫金凰庭','紫景雅苑','紫园','紫竹名苑','尊贵丽景家园']
    start_urls = []
    for keyword in keywordList:
        url = keyword.decode('utf-8', 'replace')
        start_urls.append("url?areaid=&type=1&flag=1&keyword=" + urllib.quote(url.encode('utf-8', 'replace')) + "&pageno=1")

    def start_requests(self):
        for url in self.start_urls:
            yield scrapy.Request(url)
    
    #通过一览页获取当日帖子列表
    def parse(self, response):
        url = urlparse.urlparse(response.url)
        sel = Selector(response)
        now = datetime.now()
        print urllib.unquote(url[4]).decode("utf-8")
        item = DmozItem()
        item['keyword'] = urllib.unquote(url[4]).decode("utf-8")
        if sel.xpath('//tr[@align="center"]'):
            for site in sel.xpath('//tr[@align="center"]'):
                content = site.xpath('td/@title').extract()
                item['keywordlen'] = len(content)
                item['location'] = site.xpath('td[2]').extract()
        else:
            item['keywordlen'] = 1
        yield item
